'''
Напишите программу, которая считывает строку-разделитель и три строки,
а затем выводит указанные строки через разделитель в следующем формате:
'''

separator = input()
line_1 = input()
line_2 = input()
line_3 = input()
print(line_1, line_2, line_3, sep = separator)