"""
Напишите программу, которая принимает через стандартный поток ввода
(команда input()) три строки, а затем выводит их в той же последовательности,
каждую на отдельной строке.
"""

a = input()
b = input()
c = input()

print(f"{a}\n{b}\n{c}\n")
